# PathReinSpanlengthBottomAlt Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinSpanlengthBottomAlt Property
ParameterTypeId Class See Also
---
"Bottom (Alternating Bar)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinSpanlengthBottomAlt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinSpanlengthBottomAlt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinSpanlengthBottomAlt {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace